tests/mutations/21-the-private-write-leaves-the-secret-world-readable.patch
# loftail — a desktop viewer for log4cplus logs.
# Copyright (C) 2026 Valentyn Pavliuchenko
#
# This program is free software: you can redistribute it and/or modify
# it under the terms of the GNU General Public License as published by
# the Free Software Foundation, either version 3 of the License, or
# (at your option) any later version.
#
# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with this program.  If not, see <https://www.gnu.org/licenses/>.
#
# SPDX-License-Identifier: GPL-3.0-or-later
#
# RULE (CLAUDE.md, "M14 ... the plain-text hosts.json fallback"):
#   AtomicJson::writePrivate() restricts the mode AFTER the rename, because
#   commit() replaces the file and a mode set on the temporary would not survive
#   it. This is the path a remembered SSH password takes where there is no
#   keychain
#
# GUARD: tst_writefailure::aPrivateWriteLeavesTheSecretReadableByNobodyElse
#
# SILENT WHEN BROKEN: the password is saved, the box stays ticked, the dialog goes on
# naming the file — and the file is 0644. Nothing on screen distinguishes it
# from the mode the checkbox promised.

diff --git a/src/core/AtomicJson.cpp b/src/core/AtomicJson.cpp
index f05628b..2c8aba2 100644
--- a/src/core/AtomicJson.cpp
+++ b/src/core/AtomicJson.cpp
@@ -80,11 +80,6 @@ bool AtomicJson::writePrivate(const QString &path, const QJsonDocument &doc, QSt
     // After the rename, not before: commit() replaces the file at `path`, so a mode
     // set on the temporary file would not survive. A failure here is worth reporting
     // — the caller wrote a secret expecting it to be unreadable by others.
-    if (!QFile::setPermissions(path, QFile::ReadOwner | QFile::WriteOwner)) {
-        if (error)
-            *error = Tr::tr("Cannot restrict permissions on %1").arg(path);
-        return false;
-    }
     return true;
 }
 
