tests/mutations/40-a-log-past-the-ceiling-is-waited-for.patch
# loftail — a desktop viewer for log4cplus logs.
# Copyright (C) 2026 Valentyn Pavliuchenko
#
# This program is free software: you can redistribute it and/or modify
# it under the terms of the GNU General Public License as published by
# the Free Software Foundation, either version 3 of the License, or
# (at your option) any later version.
#
# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with this program.  If not, see <https://www.gnu.org/licenses/>.
#
# SPDX-License-Identifier: GPL-3.0-or-later
#
# RULE (CLAUDE.md, "A LOG TOO BIG FOR THE ONLY SIZE RUNG A SERVER HAS IS A THIRD
# ANSWER"):
#   `openFile()`'s exec branch answers `Failure::Refused` for
#   `probe.tooBigToMeasure()`, above the NoSuchFile branch. Everything Failure
#   calls retryable-unattended is WAITED for, and this is the one outcome here
#   that gets further out of reach the longer it is waited for.
#
# GUARD: tst_sshlive::aLogTooBigForTheOnlySizeRungIsRefusedRatherThanCalledMissing
#
# HARNESS: needs the containerised `nosize` server — packaging/test-ssh/run-ssh-tests.sh.
#   Verified red there by hand: "Compared values are not the same".
#
# SILENT WHEN BROKEN: the tab waits for ever on a log that is present, readable
# and growing, under a sentence saying it is missing or unreadable. The pure half
# of the same rule is 38.

diff --git a/src/core/SshSession.cpp b/src/core/SshSession.cpp
index 1c6eb26..09ed88a 100644
--- a/src/core/SshSession.cpp
+++ b/src/core/SshSession.cpp
@@ -1688,21 +1688,6 @@ bool SshSession::openFile(QString *error, Failure *failure)
             // refusal that keeps its tab and says why (M17), naming the real cause: this
             // spent a tab for ever on "it is missing, or the account cannot read it"
             // about a file that was present, readable and growing.
-            if (probe.tooBigToMeasure()) {
-                kind = Failure::Refused;
-                if (error) {
-                    // Worded like SshFetcher's own kWcAbandonBytes message, which is
-                    // the same fence one step later — that one catches a log which grows
-                    // past 64 MB while being tailed, this one a log already too big to
-                    // settle on at all. Both name the remedy, which is one utility away.
-                    *error = Tr::tr("%1 on %2 is %3 MB, and the server offers no way to "
-                                    "measure it except by reading all of it. Installing "
-                                    "`stat` or `ls` on the server fixes this.")
-                                 .arg(d->location.path, d->location.host)
-                                 .arg((probe.sizeThatWasTooBig() + 524288) / (1024LL * 1024));
-                }
-                return false;
-            }
             // Indistinguishable from here: absent, or present and unreadable. Both are
             // things that change on their own, so both wait (§6.5) — the same answer
             // the SFTP branch gives for NO_SUCH_FILE and PERMISSION_DENIED.
