tests/mutations/10-density-buckets-merge-by-first-wins.patch
# loftail — a desktop viewer for log4cplus logs.
# Copyright (C) 2026 Valentyn Pavliuchenko
#
# This program is free software: you can redistribute it and/or modify
# it under the terms of the GNU General Public License as published by
# the Free Software Foundation, either version 3 of the License, or
# (at your option) any later version.
#
# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with this program.  If not, see <https://www.gnu.org/licenses/>.
#
# SPDX-License-Identifier: GPL-3.0-or-later
#
# RULE (CLAUDE.md, "the whole view rather than the part on screen"):
#   Past kMaxBuckets the buckets are merged pairwise by a bitwise OR over the class
#   bits, never by keeping one of the two — a bucket of a big log covers thousands of
#   rows, and while it held a single winning rule index whole colours were absent.
#
# GUARD: tst_densitymap::theCoarseningThatGrowthForcesUnionsTheBucketsItMerges
#
# SILENT WHEN BROKEN: the bar draws, the thumb tracks, and a lone ERROR among ten
# thousand WARNs is simply not on it — the one case the feature exists for.
# tst_densitymap::mergingTwoBucketsKeepsBothRules cannot see it: there the two rows share
# a bucket from the moment the map is bound, so what unions them is the SCAN.

diff --git a/src/core/DensityMap.cpp b/src/core/DensityMap.cpp
index 20eace1..ff576b8 100644
--- a/src/core/DensityMap.cpp
+++ b/src/core/DensityMap.cpp
@@ -130,7 +130,8 @@ void DensityMap::reshape()
             const int newCount = (oldCount + 1) / 2;
             QVector<Marks> merged(newCount, kNone);
             for (int i = 0; i < oldCount; ++i)
-                merged[i / 2] |= lane.bucket.at(i);
+                if (merged[i / 2] == kNone)
+                    merged[i / 2] = lane.bucket.at(i);
             lane.bucket = std::move(merged);
         }
         m_rowsPerBucket *= 2;
